[
    { "fact": "The first computer programmer was Ada Lovelace, who wrote an algorithm for Charles Babbage's Analytical Engine in the 1840s." },
    { "fact": "Python was named after 'Monty Python's Flying Circus,' not the snake." },
    { "fact": "The first-ever computer bug was an actual moth found in a relay of the Harvard Mark II computer in 1947." },
    { "fact": "The 'Hello, World!' program was first used in the book 'The C Programming Language' by Brian Kernighan and Dennis Ritchie." },
    { "fact": "Java was originally called 'Oak' but was renamed because 'Oak' was already trademarked." },
    { "fact": "Git, the version control system, was created by Linus Torvalds in 2005 to help manage Linux kernel development." },
    { "fact": "HTML is not a programming language but a markup language used to structure web pages." },
    { "fact": "The name 'JavaScript' was chosen to ride on the popularity of Java, but the two languages are not related." },
    { "fact": "Stack Overflow was launched in 2008 to provide a community-driven Q&A platform for programmers." },
    { "fact": "The world's first website, created by Tim Berners-Lee in 1991, is still online at http://info.cern.ch/" },
    { "fact": "COBOL, a language still in use today, was created in 1959 for business applications." },
    { "fact": "The C programming language was developed at Bell Labs in the 1970s to help create the UNIX operating system." },
    { "fact": "PHP originally stood for 'Personal Home Page' but was later changed to 'PHP: Hypertext Preprocessor.'" },
    { "fact": "You can write a full program in Brainfuck with only eight characters: `><+-.,[]`." },
    { "fact": "The space shuttle used computers with only 1MB of RAM during its missions." },
    { "fact": "The world's first computer virus, 'Creeper,' was created in the early 1970s and displayed the message: 'I’m the Creeper, catch me if you can!'" },
    { "fact": "The popular Python framework Django is named after Django Reinhardt, a jazz guitarist." },
    { "fact": "Dennis Ritchie, co-creator of Unix and the C language, received far less public recognition than Steve Jobs or Bill Gates." },
    { "fact": "Facebook was originally built using PHP and later rewritten in Hack, a language developed by Facebook." },
    { "fact": "The Linux kernel is mostly written in C, with a small percentage written in assembly language." },
    { "fact": "Morse code inspired the binary numbering system used in computers today." },
    { "fact": "The 'QWERTY' keyboard layout was designed in the 1870s for typewriters and is still in use today despite alternatives like Dvorak and Colemak." },
    { "fact": "Over 90% of the world's supercomputers run on Linux." },
    { "fact": "The Java mascot is called 'Duke' and was originally designed as an animated character for interactive TV applications." },
    { "fact": "The 'Foo' and 'Bar' used in programming examples come from the military slang term 'FUBAR' (F***ed Up Beyond All Recognition)." }
]
