[
  {"q": "Success is not final, failure is not fatal: it is the courage to continue that counts.", "a": "Winston Churchill"},
  {"q": "Believe you can and you’re halfway there.", "a": "Theodore Roosevelt"},
  {"q": "Do what you can, with what you have, where you are.", "a": "Theodore Roosevelt"},
  {"q": "The only way to do great work is to love what you do.", "a": "Steve Jobs"},
  {"q": "It always seems impossible until it’s done.", "a": "Nelson Mandela"},
  {"q": "Don’t let yesterday take up too much of today.", "a": "Will Rogers"},
  {"q": "You learn more from failure than from success.", "a": "Anonymous"},
  {"q": "Dream big and dare to fail.", "a": "Norman Vaughan"},
  {"q": "What lies behind us and what lies before us are tiny matters compared to what lies within us.", "a": "Ralph Waldo Emerson"},
  {"q": "We may encounter many defeats but we must not be defeated.", "a": "Maya Angelou"},
  {"q": "Act as if what you do makes a difference. It does.", "a": "William James"},
  {"q": "Keep your face always toward the sunshine—and shadows will fall behind you.", "a": "Walt Whitman"},
  {"q": "The only limit to our realization of tomorrow is our doubts of today.", "a": "Franklin D. Roosevelt"},
  {"q": "Do what you feel in your heart to be right – for you’ll be criticized anyway.", "a": "Eleanor Roosevelt"},
  {"q": "It does not matter how slowly you go as long as you do not stop.", "a": "Confucius"},
  {"q": "Everything you’ve ever wanted is on the other side of fear.", "a": "George Addair"},
  {"q": "Hardships often prepare ordinary people for an extraordinary destiny.", "a": "C.S. Lewis"},
  {"q": "The best way to predict the future is to create it.", "a": "Peter Drucker"},
  {"q": "The future belongs to those who believe in the beauty of their dreams.", "a": "Eleanor Roosevelt"},
  {"q": "Quality means doing it right when no one is looking.", "a": "Henry Ford"},
  {"q": "If everything seems under control, you’re not going fast enough.", "a": "Mario Andretti"},
  {"q": "I find that the harder I work, the more luck I seem to have.", "a": "Thomas Jefferson"},
  {"q": "You must be the change you wish to see in the world.", "a": "Mahatma Gandhi"},
  {"q": "Opportunities don't happen. You create them.", "a": "Chris Grosser"},
  {"q": "It's not whether you get knocked down, it's whether you get up.", "a": "Vince Lombardi"},
  {"q": "Perseverance is failing 19 times and succeeding the 20th.", "a": "Julie Andrews"},
  {"q": "You miss 100% of the shots you don’t take.", "a": "Wayne Gretzky"},
  {"q": "Your limitation—it’s only your imagination.", "a": "Anonymous"},
  {"q": "Push yourself, because no one else is going to do it for you.", "a": "Anonymous"},
  {"q": "Great things never come from comfort zones.", "a": "Anonymous"},
  {"q": "Dream it. Wish it. Do it.", "a": "Anonymous"},
  {"q": "Success doesn’t just find you. You have to go out and get it.", "a": "Anonymous"},
  {"q": "The harder you work for something, the greater you’ll feel when you achieve it.", "a": "Anonymous"},
  {"q": "Don’t stop when you’re tired. Stop when you’re done.", "a": "Anonymous"},
  {"q": "Wake up with determination. Go to bed with satisfaction.", "a": "Anonymous"},
  {"q": "Do something today that your future self will thank you for.", "a": "Anonymous"},
  {"q": "Little things make big days.", "a": "Anonymous"},
  {"q": "It’s going to be hard, but hard does not mean impossible.", "a": "Anonymous"},
  {"q": "Don’t wait for opportunity. Create it.", "a": "Anonymous"},
  {"q": "Sometimes we’re tested not to show our weaknesses, but to discover our strengths.", "a": "Anonymous"},
  {"q": "The key to success is to focus on goals, not obstacles.", "a": "Anonymous"},
  {"q": "Dream bigger. Do bigger.", "a": "Anonymous"},
  {"q": "Difficult roads often lead to beautiful destinations.", "a": "Anonymous"},
  {"q": "Work hard in silence, let success be your noise.", "a": "Frank Ocean"},
  {"q": "Success is what comes after you stop making excuses.", "a": "Luis Galarza"},
  {"q": "Don’t be pushed around by the fears in your mind. Be led by the dreams in your heart.", "a": "Roy T. Bennett"},
  {"q": "Your passion is waiting for your courage to catch up.", "a": "Isabelle Lafleche"},
  {"q": "Magic is believing in yourself. If you can make that happen, you can make anything happen.", "a": "Johann Wolfgang Von Goethe"},
  {"q": "If something is important enough, even if the odds are against you, you should still do it.", "a": "Elon Musk"},
  {"q": "Hold the vision, trust the process.", "a": "Anonymous"},
  {"q": "Don’t be afraid to give up the good to go for the great.", "a": "John D. Rockefeller"},
  {"q": "People who wonder if the glass is half empty or full miss the point. The glass is refillable.", "a": "Anonymous"},
  {"q": "The best way to get started is to quit talking and begin doing.", "a": "Walt Disney"},
  {"q": "Life’s battles don’t always go to the stronger or faster man. But sooner or later, the man who wins is the man who thinks he can.", "a": "Vince Lombardi"},
  {"q": "Strength doesn’t come from what you can do. It comes from overcoming the things you once thought you couldn’t.", "a": "Rikki Rogers"},
  {"q": "Someday is not a day of the week.", "a": "Denise Brennan-Nelson"},
  {"q": "Do what you have to do until you can do what you want to do.", "a": "Oprah Winfrey"},
  {"q": "Motivation is what gets you started. Habit is what keeps you going.", "a": "Jim Ryun"},
  {"q": "Work like hell. I mean you just have to put in 80 to 100 hour weeks every week.", "a": "Elon Musk"}
]
